{
    "experiences": [
        {
            "companyName": "Mastercard",
            "companyLogo": "/assets/images/logo-mastercard.svg",
            "companyUrl": "https://mastercard.co.in/",
            "jobTitle": "Senior Software Engineer",
            "awards": [
                {
                    "title": "Create Value (May 2024)",
                    "img": "/assets/images/certificates/CreateValue-1.jpg"
                },
                {
                    "title": "Create Value (Sep 2024)",
                    "img": "/assets/images/certificates/CreateValue-2.jpg"
                },
                {
                    "title": "Grow Together (Oct 2024)",
                    "img": "/assets/images/certificates/GrowTogether-1.jpg"
                }
            ],
            "description": [
                "Received <mark>3 spot awards</mark> in recognition of impactful contributions, including tool development, process improvements, and successful project delivery.",
                "Spearheaded the development of an <mark>Auto PR Reviewer</mark> (CodeSentinel) product, accelerating the code review process by providing real-time review comments through static analysis.",
                "Implement and enhance various types of authentication mechanisms such as 3DS and other proprietary protocols.",
                "Contributed to critical fixes and enhancements in Checkout service and Authentication service in <mark><a href=\"https://developer.mastercard.com/product/click-to-pay\" rel=\"noreferrer\" target=\"_blank\" style={{textDecoration: 'none', color: 'inherit'}}>MasterCard Checkout Solutions (MACS)</a></mark>, leveraging Java, Spring Boot, and Redis, integrating multiple micro-services and implementing a caching mechanism for optimal performance.",
                "Enhanced project efficiency with a custom <mark>WireMock Extention</mark> for monitoring and removing redundant stubbings from functional tests. Successfully deleted 5000 unused WireMocks, significantly optimizing project health.",
                "Developed the <mark>Payload Decryption Service</mark> (Checkout Toolkit WebUI), enhancing developer efficiency and earning cross-team recognition.",
                "Automated the update process for PCF environment variables using <mark>custom scripts</mark>, reducing manual efforts and increasing operational efficiency.",
                "Implemented <mark>PACT contract testing</mark> and functional testing using the <mark>Karate framework</mark>, improving test accuracy and early detection of integration issues."

            ],
            "startDate": "Feb 2024",
            "endDate": "present"
        },
        {
            "companyName": "Opus Technologies",
            "companyLogo": "/assets/images/opus_logo.svg",
            "companyUrl": "https://opustechglobal.com/",
            "jobTitle": "Senior Tech Engineer",
            "awards": [
                {
                    "title": "Individual Award (Q2 2022)",
                    "img": "/assets/images/certificates/Spot-Award-Opus.png"
                },
                {
                    "title": "Individual Award (Q4 2022)",
                    "img": "/assets/images/certificates/Spot-Award-Opus.png"
                },
                {
                    "title": "Individual Award (Q3 2023)",
                    "img": "/assets/images/certificates/Spot-Award-Opus.png"
                }
            ],
            "description": [
                "Received <mark>3x Spot Awards</mark> for outstanding quality of work.",
                "Created an <mark>Audit Logging</mark> framework using Java and Spring Boot to intercept every API request in microservices, improving tracking and enhancing security.",
                
                "Streamlined the <mark>PCI-SSF</mark> features in the application, including Data Encryption and Data Masking, according to user permissions using Java, Spring Boot, and Hibernate. This resulted in improved security compliance.",
                "Implemented an <mark>Event Logging</mark> framework using Java and Spring Boot to raise events for important user actions in all microservices. This improved application monitoring and resulted in a 50% reduction in time taken to identify and resolve issues.",
                "Created BPMN models using <mark>Camunda Zeebe Modeler</mark> to improve process efficiency and reduce development time.",
                "Implemented <mark>JWT authorization</mark> globally in one service for payment processing and worked on microservices orchestration using Camunda."
            ],
            "startDate": "Feb 2022",
            "endDate": "Feb 2024"
        },
        {
            "companyName": "Cerence",
            "companyLogo": "/assets/images/cerence_logo.svg",
            "companyUrl": "https://www.cerence.com",
            "jobTitle": "Software Engineer",
            "awards": [],
            "description": [
                "Developed features for Cerence's Natural Language Processing Server <mark>(NLPS)</mark> using Agile Scrum methodology, improving its functionality and performance.",
                "Designed and built a <mark>data extraction utility</mark> to manage and analyze JSON data.",
                "Tested and deployed <mark>docker</mark> images to Kubernetes for optimal system performance.",
                "Collaborated with QA and deployment teams to ensure high-quality software solutions and effective deployment strategies.",
                "Troubleshot and resolved production issues to minimize downtime and ensure uninterrupted service delivery."
            ],
            "startDate": "May 2021",
            "endDate": "Feb 2022"
        },
        {
            "companyName": "Netcracker",
            "companyLogo": "/assets/images/netcracker-logo.svg",
            "companyUrl": "https://www.netcracker.com",
            "jobTitle": "Software Engineer",
            "awards": [],
            "description": [
                "Agile development using <mark>Jira, Jenkins, SVN</mark>.",
                "Worked with the senior software developer to understand the product and technologies used. ",
                "Modelling of network devices into logical entities."
            ],
            "startDate": "Mar 2021",
            "endDate": "May 2021",
            "isHiddden": true
        },
        {
            "companyName": "Amdocs",
            "companyLogo": "/assets/images/amdocs-logo.png",
            "companyUrl": "https://www.amdocs.com",
            "jobTitle": "Software Developer",
            "awards": [
                {
                    "title": "Spot Award",
                    "img": "/assets/images/certificates/Spot-Award-Amdocs.png"
                }
            ],
            "description": [
                "Received <mark>Spot Award</mark> for excellent work.",
                "Developed <mark>RESTful web service</mark> to handle data transmission between in-house app and vendor DNS management app for efficient DNS address registration.",
                "Automated package deployment on Linux through <mark>Ansible</mark> and shell scripting.",
                "Contributed to product architectural design and analysis, actively participating in meetings and discussions.",
                "Monitored microservices logs with <mark>EFK Stack</mark> - Elasticsearch, Fluentd, and Kibana.",
                "Orchestrated Docker containers with <mark>Kubernetes</mark> platform for efficient deployment and management of applications.",
                "Managed code with <mark>GitLab/GitHub</mark> and contributed to development of integrated CI/CD pipeline for code reviews, testing, and deployment."
            ],
            "startDate": "Oct 2017",
            "endDate": "Feb 2021"
        }
    ]
}